---
kind: type
id: T:Autodesk.Revit.DB.PolylineNode
source: html/d0d38779-f0a4-e975-e71d-c8e7026cadfd.htm
---
# Autodesk.Revit.DB.PolylineNode

An output node that represents a 3D polyline.

## Syntax (C#)
```csharp
public class PolylineNode : ModelCurveNode
```

## Remarks
See also: OnPolyline(PolylineNode) .